<a href="https://colab.research.google.com/github/LQDJerry/MachLearn/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import libraries

In [88]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
from sklearn.impute import SimpleImputer
from sklearn.linear_model import LogisticRegression
from sklearn.neural_network import MLPClassifier
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

Import data from csv files

In [89]:
train =  pd.read_csv("https://github.com/LQDJerry/MachLearn/raw/main/TitanicTrain.csv")
test = pd.read_csv("https://github.com/LQDJerry/MachLearn/raw/main/TitanicTest.csv")
gSub = pd.read_csv("https://github.com/LQDJerry/MachLearn/raw/main/gender_submission.csv")

Print info from imported data

In [90]:
train

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [91]:
test.describe(include='all')

        PassengerId      Pclass  ...            Cabin Embarked
count    418.000000  418.000000  ...               91      418
unique          NaN         NaN  ...               76        3
top             NaN         NaN  ...  B57 B59 B63 B66        S
freq            NaN         NaN  ...                3      270
mean    1100.500000    2.265550  ...              NaN      NaN
std      120.810458    0.841838  ...              NaN      NaN
min      892.000000    1.000000  ...              NaN      NaN
25%      996.250000    1.000000  ...              NaN      NaN
50%     1100.500000    3.000000  ...              NaN      NaN
75%     1204.750000    3.000000  ...              NaN      NaN
max     1309.000000    3.000000  ...              NaN      NaN

[11 rows x 11 columns]

In [92]:
gSub.describe(include='all')

       PassengerId    Survived
count   418.000000  418.000000
mean   1100.500000    0.363636
std     120.810458    0.481622
min     892.000000    0.000000
25%     996.250000    0.000000
50%    1100.500000    0.000000
75%    1204.750000    1.000000
max    1309.000000    1.000000

Mapping Sex to 0 an 1

In [93]:
train["Sex"] = train_data["Sex"].map({"male":0,"female":1})
test["Sex"] = test_data["Sex"].map({"male":0,"female":1})

In [94]:
train = pd.get_dummies(train, columns=['Embarked'])
test = pd.get_dummies(test, columns=['Embarked'])

Dropping Certain Characteristics

In [95]:
train.drop(['Name', 'Cabin', 'Ticket'], axis=1, inplace=True)
test.drop(['Name', 'Cabin', 'Ticket'], axis=1, inplace=True)

Printing out new Data

In [96]:
train

     PassengerId  Survived  Pclass  ...  Embarked_C  Embarked_Q  Embarked_S
0              1         0       3  ...           0           0           1
1              2         1       1  ...           1           0           0
2              3         1       3  ...           0           0           1
3              4         1       1  ...           0           0           1
4              5         0       3  ...           0           0           1
..           ...       ...     ...  ...         ...         ...         ...
886          887         0       2  ...           0           0           1
887          888         1       1  ...           0           0           1
888          889         0       3  ...           0           0           1
889          890         1       1  ...           1           0           0
890          891         0       3  ...           0           1           0

[891 rows x 11 columns]

In [100]:
test

     PassengerId  Pclass  Sex  ...  Embarked_C  Embarked_Q  Embarked_S
0            892       3    0  ...           0           1           0
1            893       3    1  ...           0           0           1
2            894       2    0  ...           0           1           0
3            895       3    0  ...           0           0           1
4            896       3    1  ...           0           0           1
..           ...     ...  ...  ...         ...         ...         ...
413         1305       3    0  ...           0           0           1
414         1306       1    1  ...           1           0           0
415         1307       3    0  ...           0           0           1
416         1308       3    0  ...           0           0           1
417         1309       3    0  ...           1           0           0

[418 rows x 10 columns]

In [97]:
target = train["Survived"]

charData = ["Pclass", "Sex", "Age", "SibSp", "Parch", "Fare", "Embarked_C", "Embarked_Q", "Embarked_S"]
trainDummies = pd.get_dummies(train[charData])
testDummies = pd.get_dummies(test[charData])

imputer = SimpleImputer()
trainDummies = imputer.fit_transform(trainDummies)
testDummies = imputer.fit_transform(testDummies)

trainx, testx, trainy, testy = train_test_split(trainDummies, target, test_size=0.33, random_state=10)

Use classifier and find model accuracy

In [98]:
clf = MLPClassifier(hidden_layer_sizes= (50,),max_iter=50000, activation='logistic', solver= 'lbfgs', random_state=1).fit(trainx, trainy)

model_accuracy = clf.score(testx, testy)

model_accuracy

/usr/local/lib/python3.7/dist-packages/sklearn/neural_network/_multilayer_perceptron.py:549: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of f AND g EVALUATIONS EXCEEDS LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
  self.n_iter_ = _check_optimize_result("lbfgs", opt_res, self.max_iter)

0.7491525423728813

Prepare submission

In [99]:
ID = test['PassengerId']
predictions = clf.predict(testDummies)
result = pd.DataFrame({ 'PassengerId' : ID, 'Survived': predictions})
result.to_csv('titanicSubmission.csv', index = False)
result.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

![image.png]()